driver-tests/bpelse/assign/AssignJbi/test/echoStringDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoStringDataType">
    <string>string</string>
    <normalizedString>string</normalizedString>
    <token>string</token>
    <base64Binary>string</base64Binary>
    <hexBinary>string</hexBinary>
    <integer>string</integer>
    <positiveInteger>string</positiveInteger>
    <negativeInteger>string</negativeInteger>
    <nonNegativeInteger>string</nonNegativeInteger>
    <nonPositiveInteger>string</nonPositiveInteger>
    <long>string</long>
    <unsignedLong>string</unsignedLong>
    <int>string</int>
    <unsignedInt>string</unsignedInt>
    <short>string</short>
    <unsignedShort>string</unsignedShort>
    <byte>string</byte>
    <unsignedByte>string</unsignedByte>
    <decimal>string</decimal>
    <float>string</float>
    <double>string</double>
    <boolean>string</boolean>
    <duration>string</duration>
    <dateTime>string</dateTime>
    <date>string</date>
    <time>string</time>
    <gYear>string</gYear>
    <gYearMonth>string</gYearMonth>
    <gMonth>string</gMonth>
    <gMonthDay>string</gMonthDay>
    <gDay>string</gDay>
    <Name>string</Name>
    <QName>string</QName>
    <NCName>string</NCName>
    <anyURI>string</anyURI>
    <language>string</language>
    <ID>string</ID>
    <IDREF>string</IDREF>
    <IDREFS>string</IDREFS>
    <ENTITY>string</ENTITY>
    <ENTITIES>string</ENTITIES>
    <NMTOKEN>string</NMTOKEN>
    <NMTOKENS>string</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
